RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_rcc.c
/**
 **************************************************************************
 * File Name    : at32f4xx_rcc.c
 * Description  : at32f4xx RCC source file
 * Date         : 2018-02-26
 * Version      : V1.0.4
 **************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_rcc.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup RCC
  * @brief RCC driver modules
  * @{
  */

/** @defgroup RCC_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup RCC_Private_Defines
  * @{
  */

/* ------------ RCC registers bit address in the alias region ----------- */
#define RCC_OFFSET                  (RCC_BASE - PERIPH_BASE)

/* --- CTRL Register ---*/

/* Alias word address of HSIEN bit */
#define CTRL_OFFSET                 (RCC_OFFSET + 0x00)
#define HSIEN_BitPos                0x00
#define CTRL_HSIEN_BB               (PERIPH_BB_BASE + (CTRL_OFFSET * 32) + (HSIEN_BitPos * 4))

/* Alias word address of PLLEN bit */
#define PLLEN_BitPos                0x18
#define CTRL_PLLEN_BB               (PERIPH_BB_BASE + (CTRL_OFFSET * 32) + (PLLEN_BitPos * 4))

/* Alias word address of HSECFDEN bit */
#define HSECFDEN_BitPos             0x13
#define CTRL_HSECFDEN_BB            (PERIPH_BB_BASE + (CTRL_OFFSET * 32) + (HSECFDEN_BitPos * 4))

#define HSICAL_BitPos               (8)
#if defined (AT32F403xx)
#define HSITWK_BitPos               (3)
#else
#define HSITWK_BitPos               (2)
#endif

/* --- CFG Register ---*/

/* Alias word address of USBPSC bit */
#define CFG_OFFSET                  (RCC_OFFSET + 0x04)

/* --- BDC Register ---*/
#if defined (AT32F415xx)
/* Alias word address of ERTCEN bit */
#define BDC_OFFSET                  (RCC_OFFSET + 0x20)
#define ERTCEN_BitPos                0x0F
#define BDC_ERTCEN_BB                (PERIPH_BB_BASE + (BDC_OFFSET * 32) + (ERTCEN_BitPos * 4))
#else
/* Alias word address of RTCEN bit */
#define BDC_OFFSET                  (RCC_OFFSET + 0x20)
#define RTCEN_BitPos                0x0F
#define BDC_RTCEN_BB                (PERIPH_BB_BASE + (BDC_OFFSET * 32) + (RTCEN_BitPos * 4))
#endif

/* Alias word address of BDRST bit */
#define BDRST_BitPos                0x10
#define BDC_BDRST_BB                (PERIPH_BB_BASE + (BDC_OFFSET * 32) + (BDRST_BitPos * 4))

/* --- CTRLSTS Register ---*/

/* Alias word address of LSIEN bit */
#define CTRLSTS_OFFSET              (RCC_OFFSET + 0x24)
#define LSIEN_BitPos                0x00
#define CTRLSTS_LSIEN_BB            (PERIPH_BB_BASE + (CTRLSTS_OFFSET * 32) + (LSIEN_BitPos * 4))

#define MISC_OFFSET                (RCC_OFFSET + 0x30)

/* ---------------------- RCC registers bit mask ------------------------ */

/* CFG register bit mask */
#define CFG_PLL_Mask                RCC_CFG_PLLCFG_MASK

#define CFG_ADCPSC_Pos              ((uint32_t)14)
#define CFG_ADCPSCBit2_IdxMask      ((uint32_t)4)

#define CFG_ADCPSC_Rst_Mask         ((uint32_t)~RCC_CFG_ADCPSC)
#define CFG_ADCPSC_Set_Mask         ((uint32_t)0x0000C000)
#define CFG_ADCPSCBit2_Set_Mask     ((uint32_t)0x10000000)

/* RCC Flag Mask */
#define FLAG_Mask                   ((uint8_t)0x1F)

/* CLKINT register byte 2 (Bits[15:8]) base address */
#define CLKINT_BYTE2_EN_ADDR        ((uint32_t)0x40021009)

/* CLKINT register byte 3 (Bits[23:16]) base address */
#define CLKINT_BYTE3_CLR_ADDR       ((uint32_t)0x4002100A)

/* BDC register base address */
#define BDC_BYTE0_LSE_ADDR          (PERIPH_BASE + BDC_OFFSET)

/* MISC register base address */
#define MISC_BYTE0_HSICALKEY_ADDR   (PERIPH_BASE + MISC_OFFSET)
#define MISC_HSICAL_ENABLE_KEY      ((uint8_t)0x5A)
#define MISC_HSICAL_DISABLE_KEY     ((uint8_t)0x0)

/**
  * @}
  */

/** @defgroup RCC_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup RCC_Private_Variables
  * @{
  */
static __I uint8_t APBAHBPscTable[8] = {1, 2, 3, 4, 6, 7, 8, 9};
static __I uint8_t ADCPscTable[8] = {2, 4, 6, 8, 2, 12, 8, 16};

/**
  * @}
  */

/** @defgroup RCC_Private_FunctionPrototypes
  * @{
  */
static void RCC_HSEENDelay(uint32_t);

/**
  * @}
  */

/** @defgroup RCC_Private_Functions
  * @{
  */

/**
  * @brief  Resets the RCC clock configuration to the default reset state.
  * @param  None
  * @retval None
  */
void RCC_Reset(void)
{
  /* Set HSIEN bit */
  RCC->CTRL |= (uint32_t)0x00000001;

  /* Reset SYSCLKSEL, AHBPSC, APB1PSC, APB2PSC, ADCPSC and CLKOUT bits */
  RCC->CFG &= (uint32_t)0xE8FF0000;

  /* Reset HSEEN, HSECFDEN and PLLEN bits */
  RCC->CTRL &= (uint32_t)0xFEF6FFFF;

  /* Reset HSEBYPS bit */
  RCC->CTRL &= (uint32_t)0xFFFBFFFF;

  /* Reset PLLRC, PLLHSEPSC, PLLMUL, PLLFREQRANGE, and USBPSC bits */
  RCC->CFG &= (uint32_t)0x1700FFFF;

  /* Disable all interrupts and clear pending bits  */
  RCC->CLKINT = 0x009F0000;

  /* Reset USB768B, CLKOUT[3], HSICAL_KEY[7:0] */
  RCC->MISC &= 0xFEFEFF00;
}

/**
  * @brief  Configures the External High Speed oscillator (HSE).
  * @note   HSE can not be stopped if it is used directly or through the PLL as system clock.
  * @param  RCC_HSE: specifies the new state of the HSE.
  *   This parameter can be one of the following values:
  *     @arg RCC_HSE_DISABLE: HSE oscillator OFF
  *     @arg RCC_HSE_ENABLE: HSE oscillator ON
  *     @arg RCC_HSE_BYPASS: HSE oscillator bypassed with external clock
  * @retval None
  */
void RCC_HSEConfig(uint32_t RCC_HSE)
{
  /* Check the parameters */
  assert_param(IS_RCC_HSE(RCC_HSE));
  /* Reset HSEEN and HSEBYPS bits before configuring the HSE ------------------*/
  /* Reset HSEEN bit */
  RCC->CTRL &= ~RCC_CTRL_HSEEN;
  /* Reset HSEBYPS bit */
  RCC->CTRL &= ~RCC_CTRL_HSEBYPS;

  /* Configure HSE (RCC_HSE_DISABLE is already covered by the code section above) */
  switch(RCC_HSE)
  {
  case RCC_HSE_ENABLE:
    /* Set HSEEN bit */
    RCC->CTRL |= RCC_CTRL_HSEEN;
    break;

  case RCC_HSE_BYPASS:
    /* Set HSEBYPS and HSEEN bits */
    RCC->CTRL |= RCC_CTRL_HSEBYPS | RCC_CTRL_HSEEN;
    break;

  default:
    break;
  }
}

/**
  * @brief  Waits for HSE start-up.
  * @param  None
  * @retval An ErrorStatus enumuration value:
  * - SUCCESS: HSE oscillator is stable and ready to use
  * - ERROR: HSE oscillator not yet ready
  */
ErrorStatus RCC_WaitForHSEStable(void)
{
  __IO uint32_t StartUpCounter = 0;
  ErrorStatus status = ERROR;
  FlagStatus HSEStatus = RESET;

  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    HSEStatus = RCC_GetFlagStatus(RCC_FLAG_HSESTBL);
    StartUpCounter++;
  }
  while((StartUpCounter != HSE_STARTUP_TIMEOUT) && (HSEStatus == RESET));

  /* Delay for HSE Stable */
  RCC_HSEENDelay(HSE_STABLE_DELAY);

  if (RCC_GetFlagStatus(RCC_FLAG_HSESTBL) != RESET)
  {
    status = SUCCESS;
  }
  else
  {
    status = ERROR;
  }

  return (status);
}

/**
  * @brief  Adjusts the Internal High Speed oscillator (HSI) calibration value.
  * @param  HSITweakValue: specifies the calibration trimming value.
  *   This parameter must be a number between 0 and 0x1F.
  * @retval None
  */
void RCC_SetHSITweakValue(uint8_t HSITweakValue)
{
  uint32_t tmpreg = 0;
  /* Check the parameters */
  assert_param(IS_RCC_TWEAK_VALUE(HSITweakValue));
  tmpreg = RCC->CTRL;
  /* Clear HSITWK[4:0] bits */
  tmpreg &= ~RCC_CTRL_HSITWK;
  /* Set the HSITWK[4:0] bits according to HSITweakValue value */
  tmpreg |= (uint32_t)HSITweakValue << HSITWK_BitPos;
  /* Store the new value */
  RCC->CTRL = tmpreg;
}


/**
  * @brief  Adjusts the Internal High Speed oscillator (HSI) calibration value.
  * @param  HSICalibValue: specifies the calibration value.
  *   This parameter must be a number between 0 and 0xFF.
  * @retval None
  */
void RCC_SetHSICalibValue(uint8_t HSICalibValue)
{
  uint32_t tmpreg = 0;
  /* Check the parameters */
  assert_param(IS_RCC_CALIB_VALUE(HSICalibValue));

