RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_rcc.c
  /* Enable write HSICAL */
  *(__IO uint8_t *) MISC_BYTE0_HSICALKEY_ADDR = MISC_HSICAL_ENABLE_KEY;

  /* Get RCC_CTRL and clear HSICAL bits */
  tmpreg = RCC->CTRL & (~RCC_CTRL_HSICAL);
  /* Set the HSICAL[7:0] bits according to HSICalibValue value */
  tmpreg |= (uint32_t)HSICalibValue << HSICAL_BitPos;
  /* Store the new value */
  RCC->CTRL = tmpreg;

  /* Disable write HSICAL */
  *(__IO uint8_t *) MISC_BYTE0_HSICALKEY_ADDR = MISC_HSICAL_DISABLE_KEY;
}


/**
  * @brief  Enables or disables the Internal High Speed oscillator (HSI).
  * @note   HSI can not be stopped if it is used directly or through the PLL as system clock.
  * @param  NewState: new state of the HSI. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_HSICmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) CTRL_HSIEN_BB = (uint32_t)NewState;
}

/**
  * @brief  Configures the PLL clock source and multiplication factor.
  * @note   This function must be used only when the PLL is disabled.
  * @param  RCC_PLLRefClk: specifies the PLL entry clock source.
  *   This parameter can be one of the following values:
  *     @arg RCC_PLLRefClk_HSI_Div2: HSI oscillator clock divided by 2 selected as PLL clock entry
  *     @arg RCC_PLLRefClk_HSE_Div1: HSE oscillator clock selected as PLL clock entry
  *     @arg RCC_PLLRefClk_HSE_Div2: HSE oscillator clock divided by 2 selected as PLL clock entry
  * @param  RCC_PLLMult: specifies the PLL multiplication factor.
  *               This parameter can be RCC_PLLMult_x where x:[2,64]
  * @param  RCC_PLLRange: specifies the PLL frequency range
  *     @arg RCC_Range_LessEqual_72Mhz: When PLL output is less than or equal to 72 MHz.
  *     @arg RCC_Range_GreatThan_72Mhz: When PLL output is greater than 72 MHz.
  *
  * @retval None
  */
void RCC_PLLConfig(uint32_t RCC_PLLRefClk, uint32_t RCC_PLLMult, uint32_t RCC_PLLRange)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_PLL_CFG(RCC_PLLRefClk));
  assert_param(IS_RCC_PLL_MULT(RCC_PLLMult));
  assert_param(IS_RCC_PLL_RANGE(RCC_PLLRange));

  tmpreg = RCC->CFG;
  /* Clear PLLRC, PLLHSEPSC and PLLMULT[5:0] bits */
  tmpreg &= CFG_PLL_Mask;
  /* Set the PLL configuration bits */
  tmpreg |= RCC_PLLRefClk | RCC_PLLMult | RCC_PLLRange;
  /* Store the new value */
  RCC->CFG = tmpreg;
}

/**
  * @brief  Enables or disables the PLL.
  * @note   The PLL can not be disabled if it is used as system clock.
  * @param  NewState: new state of the PLL. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_PLLCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  *(__IO uint32_t *) CTRL_PLLEN_BB = (uint32_t)NewState;
}

/**
  * @brief  Configures the system clock (SYSCLK).
  * @param  RCC_SYSCLKSelect: specifies the clock source used as system clock.
  *   This parameter can be one of the following values:
  *     @arg RCC_SYSCLKSelction_HSI: HSI selected as system clock
  *     @arg RCC_SYSCLKSelction_HSE: HSE selected as system clock
  *     @arg RCC_SYSCLKSelction_PLL: PLL selected as system clock
  * @retval None
  */
void RCC_SYSCLKConfig(uint32_t RCC_SYSCLKSelect)
{
  uint32_t tmpreg = 0;
  /* Check the parameters */
  assert_param(IS_RCC_SYSCLK_CFG(RCC_SYSCLKSelect));
  tmpreg = RCC->CFG;
  /* Clear SYSCLKSEL[1:0] bits */
  tmpreg &= ~RCC_CFG_SYSCLKSEL;
  /* Set SYSCLKSEL[1:0] bits according to RCC_SYSCLKSelect value */
  tmpreg |= RCC_SYSCLKSelect;
  /* Store the new value */
  RCC->CFG = tmpreg;
}

/**
  * @brief  Returns the clock source used as system clock.
  * @param  None
  * @retval The clock source used as system clock. The returned value can
  *   be one of the following:
  *     - 0x00: HSI used as system clock
  *     - 0x04: HSE used as system clock
  *     - 0x08: PLL used as system clock
  */
uint8_t RCC_GetSYSCLKSelction(void)
{
  return ((uint8_t)(RCC->CFG & RCC_CFG_SYSCLKSTS));
}

/**
  * @brief  Configures the AHB clock (HCLK).
  * @param  RCC_SYSCLK_Div: defines the AHB clock divider. This clock is derived from
  *   the system clock (SYSCLK).
  *   This parameter can be one of the following values:
  *     @arg RCC_SYSCLK_Div1: AHB clock = SYSCLK
  *     @arg RCC_SYSCLK_Div2: AHB clock = SYSCLK/2
  *     @arg RCC_SYSCLK_Div4: AHB clock = SYSCLK/4
  *     @arg RCC_SYSCLK_Div8: AHB clock = SYSCLK/8
  *     @arg RCC_SYSCLK_Div16: AHB clock = SYSCLK/16
  *     @arg RCC_SYSCLK_Div64: AHB clock = SYSCLK/64
  *     @arg RCC_SYSCLK_Div128: AHB clock = SYSCLK/128
  *     @arg RCC_SYSCLK_Div256: AHB clock = SYSCLK/256
  *     @arg RCC_SYSCLK_Div512: AHB clock = SYSCLK/512
  * @retval None
  */
void RCC_AHBCLKConfig(uint32_t RCC_SYSCLK_Div)
{
  uint32_t tmpreg = 0;
  /* Check the parameters */
  assert_param(IS_RCC_AHBCLK(RCC_SYSCLK_Div));
  tmpreg = RCC->CFG;
  /* Clear AHBPSC[3:0] bits */
  tmpreg &= ~RCC_CFG_AHBPSC;
  /* Set AHBPSC[3:0] bits according to RCC_SYSCLK_Div value */
  tmpreg |= RCC_SYSCLK_Div;
  /* Store the new value */
  RCC->CFG = tmpreg;
}

/**
  * @brief  Configures the Low Speed APB clock (PCLK1).
  * @param  RCC_HCLK_Div: defines the APB1 clock divider. This clock is derived from
  *   the AHB clock (HCLK).
  *   This parameter can be one of the following values:
  *     @arg RCC_AHBCLK_Div1: APB1 clock = HCLK
  *     @arg RCC_AHBCLK_Div2: APB1 clock = HCLK/2
  *     @arg RCC_AHBCLK_Div4: APB1 clock = HCLK/4
  *     @arg RCC_AHBCLK_Div8: APB1 clock = HCLK/8
  *     @arg RCC_AHBCLK_Div16: APB1 clock = HCLK/16
  * @retval None
  */
void RCC_APB1CLKConfig(uint32_t RCC_HCLK_Div)
{
  uint32_t tmpreg = 0;
  /* Check the parameters */
  assert_param(IS_RCC_APBCLK(RCC_HCLK_Div));
  tmpreg = RCC->CFG;
  /* Clear APB1PSC[2:0] bits */
  tmpreg &= ~RCC_CFG_APB1PSC;
  /* Set APB1PSC[2:0] bits according to RCC_HCLK_Div value */
  tmpreg |= RCC_HCLK_Div;
  /* Store the new value */
  RCC->CFG = tmpreg;
}

/**
  * @brief  Configures the High Speed APB clock (PCLK2).
  * @param  RCC_HCLK_Div: defines the APB2 clock divider. This clock is derived from
  *   the AHB clock (HCLK).
  *   This parameter can be one of the following values:
  *     @arg RCC_AHBCLK_Div1: APB2 clock = HCLK
  *     @arg RCC_AHBCLK_Div2: APB2 clock = HCLK/2
  *     @arg RCC_AHBCLK_Div4: APB2 clock = HCLK/4
  *     @arg RCC_AHBCLK_Div8: APB2 clock = HCLK/8
  *     @arg RCC_AHBCLK_Div16: APB2 clock = HCLK/16
  * @retval None
  */
void RCC_APB2CLKConfig(uint32_t RCC_HCLK_Div)
{
  uint32_t tmpreg = 0;
  /* Check the parameters */
  assert_param(IS_RCC_APBCLK(RCC_HCLK_Div));
  tmpreg = RCC->CFG;
  /* Clear APB2PSC[2:0] bits */
  tmpreg &= ~RCC_CFG_APB2PSC;
  /* Set APB2PSC[2:0] bits according to RCC_HCLK_Div value */
  tmpreg |= RCC_HCLK_Div << 3;
  /* Store the new value */
  RCC->CFG = tmpreg;
}

/**
  * @brief  Enables or disables the specified RCC interrupts.
  * @param  RCC_INT: specifies the RCC interrupt sources to be enabled or disabled.
  *   this parameter can be any combination of the following values.
  *     @arg RCC_INT_LSISTBL: LSI ready interrupt
  *     @arg RCC_INT_LSESTBL: LSE ready interrupt
  *     @arg RCC_INT_HSISTBL: HSI ready interrupt
  *     @arg RCC_INT_HSESTBL: HSE ready interrupt
  *     @arg RCC_INT_PLLSTBL: PLL ready interrupt
  *
  * @param  NewState: new state of the specified RCC interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_INTConfig(uint8_t RCC_INT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RCC_INT_EN(RCC_INT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Perform Byte access to RCC_CLKINT bits to enable the selected interrupts */
    *(__IO uint8_t *) CLKINT_BYTE2_EN_ADDR |= RCC_INT;
  }
  else
  {
    /* Perform Byte access to RCC_CLKINT bits to disable the selected interrupts */
    *(__IO uint8_t *) CLKINT_BYTE2_EN_ADDR &= (uint8_t)~RCC_INT;
  }
}

/**
  * @brief  Configures the USB clock (USBCLK).
  * @param  RCC_USBCLKSelect: specifies the USB clock source. This clock is
  *   derived from the PLL output.
  *   This parameter can be one of the following values:
  *     @arg RCC_USBCLKSelection_PLL_Div1_5:  PLL clock divided by 1.5 selected as USB clock source
  *     @arg RCC_USBCLKSelection_PLL_Div1:    PLL clock selected as USB clock source
  *     @arg RCC_USBCLKSelection_PLL_Div2_5:  PLL clock divided by 2.5 selected as USB clock source
  *     @arg RCC_USBCLKSelection_PLL_Div2:    PLL clock divided by 2 selected as USB clock source
  *     @arg RCC_USBCLKSelection_PLL_Div3_5:  PLL clock divided by 3.5 selected as USB clock source
  *     @arg RCC_USBCLKSelection_PLL_Div3:    PLL clock divided by 3 selected as USB clock source
  *     @arg RCC_USBCLKSelection_PLL_Div4:    PLL clock divided by 4 selected as USB clock source
  * @retval None
  */
void RCC_USBCLKConfig(uint32_t RCC_USBCLKSelect)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RCC_USBCLK_CFG(RCC_USBCLKSelect));

