RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_rcc.c
  tmpreg = RCC->CFG;
  /* Clear USBPSC[2:0] bits */
  tmpreg &= ~RCC_CFG_USBPSC;
  /* Set USBPSC[2:0] bits according to RCC_USBCLKSelect value */
  tmpreg |= RCC_USBCLKSelect;
  /* Store the new value */
  RCC->CFG = tmpreg;
}

/**
  * @brief  Configures the ADC clock (ADCCLK).
  * @param  RCC_PCLK2_Div: defines the ADC clock divider. This clock is derived from
  *   the APB2 clock (PCLK2).
  *   This parameter can be one of the following values:
  *     @arg RCC_APB2CLK_Div2:  ADC clock = PCLK2/2
  *     @arg RCC_APB2CLK_Div4:  ADC clock = PCLK2/4
  *     @arg RCC_APB2CLK_Div6:  ADC clock = PCLK2/6
  *     @arg RCC_APB2CLK_Div8:  ADC clock = PCLK2/8
  *     @arg RCC_APB2CLK_Div12: ADC clock = PCLK2/12
  *     @arg RCC_APB2CLK_Div16: ADC clock = PCLK2/16
  * @retval None
  */
void RCC_ADCCLKConfig(uint32_t RCC_PCLK2_Div)
{
  uint32_t tmpreg = 0;
  /* Check the parameters */
  assert_param(IS_RCC_ADCCLK(RCC_PCLK2_Div));
  tmpreg = RCC->CFG;
  /* Clear ADCPSC[2:0] bits */
  tmpreg &= CFG_ADCPSC_Rst_Mask;
  /* Set ADCPSC[2:0] bits according to RCC_PCLK2_Div value */
  tmpreg |= RCC_PCLK2_Div;
  /* Store the new value */
  RCC->CFG = tmpreg;
}

/**
  * @brief  Configures the External Low Speed oscillator (LSE).
  * @param  RCC_LSE: specifies the new state of the LSE.
  *   This parameter can be one of the following values:
  *     @arg RCC_LSE_DISABLE: LSE oscillator OFF
  *     @arg RCC_LSE_ENABLE:  LSE oscillator ON
  *     @arg RCC_LSE_BYPASS:  LSE oscillator bypassed with external clock
  * @retval None
  */
void RCC_LSEConfig(uint8_t RCC_LSE)
{
  /* Check the parameters */
  assert_param(IS_RCC_LSE(RCC_LSE));
  /* Reset LSEEN and LSEBYPS bits before configuring the LSE ------------------*/
  /* Reset LSEEN bit */
  *(__IO uint8_t *) BDC_BYTE0_LSE_ADDR = RCC_LSE_DISABLE;
  /* Reset LSEBYPS bit */
  *(__IO uint8_t *) BDC_BYTE0_LSE_ADDR = RCC_LSE_DISABLE;

  /* Configure LSE (RCC_LSE_DISABLE is already covered by the code section above) */
  switch(RCC_LSE)
  {
  case RCC_LSE_ENABLE:
    /* Set LSEEN bit */
    *(__IO uint8_t *) BDC_BYTE0_LSE_ADDR = RCC_LSE_ENABLE;
    break;

  case RCC_LSE_BYPASS:
    /* Set LSEBYPS and LSEEN bits */
    *(__IO uint8_t *) BDC_BYTE0_LSE_ADDR = RCC_LSE_BYPASS | RCC_LSE_ENABLE;
    break;

  default:
    break;
  }
}

/**
  * @brief  Enables or disables the Internal Low Speed oscillator (LSI).
  * @note   LSI can not be disabled if the IWDG is running.
  * @param  NewState: new state of the LSI. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_LSICmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) CTRLSTS_LSIEN_BB = (uint32_t)NewState;
}

#if defined (AT32F415xx)
/**
  * @brief  Configures the ERTC clock (ERTCCLK).
  * @note   Once the ERTC clock is selected it can't be changed unless the Backup domain is reset.
  * @param  RCC_ERTCCLKSelect: specifies the ERTC clock source.
  *   This parameter can be one of the following values:
  *     @arg RCC_ERTCCLKSelection_LSE: LSE selected as ERTC clock
  *     @arg RCC_ERTCCLKSelection_LSI: LSI selected as ERTC clock
  *     @arg RCC_ERTCCLKSelection_HSE_Div128: HSE clock divided by 128 selected as ERTC clock
  * @retval None
  */
void RCC_ERTCCLKConfig(uint32_t RCC_ERTCCLKSelect)
{
  /* Check the parameters */
  assert_param(IS_RCC_ERTCCLK_SEL(RCC_ERTCCLKSelect));
  /* Select the RTC clock source */
  RCC->BDC |= RCC_ERTCCLKSelect;
}
#else
/**
  * @brief  Configures the RTC clock (RTCCLK).
  * @note   Once the RTC clock is selected it can't be changed unless the Backup domain is reset.
  * @param  RCC_RTCCLKSelect: specifies the RTC clock source.
  *   This parameter can be one of the following values:
  *     @arg RCC_RTCCLKSelection_LSE: LSE selected as RTC clock
  *     @arg RCC_RTCCLKSelection_LSI: LSI selected as RTC clock
  *     @arg RCC_RTCCLKSelection_HSE_Div128: HSE clock divided by 128 selected as RTC clock
  * @retval None
  */
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSelect)
{
  /* Check the parameters */
  assert_param(IS_RCC_RTCCLK_SEL(RCC_RTCCLKSelect));
  /* Select the RTC clock source */
  RCC->BDC |= RCC_RTCCLKSelect;
}
#endif

#if defined (AT32F415xx)
/**
  * @brief  Enables or disables the ERTC clock.
  * @note   This function must be used only after the ERTC clock was selected using the RCC_ERTCCLKConfig function.
  * @param  NewState: new state of the ERTC clock. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_ERTCCLKCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) BDC_ERTCEN_BB = (uint32_t)NewState;
}
#else
/**
  * @brief  Enables or disables the RTC clock.
  * @note   This function must be used only after the RTC clock was selected using the RCC_RTCCLKConfig function.
  * @param  NewState: new state of the RTC clock. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_RTCCLKCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  *(__IO uint32_t *) BDC_RTCEN_BB = (uint32_t)NewState;
}
#endif
/**
  * @brief  Returns the frequencies of different on chip clocks.
  * @param  RCC_Clocks: pointer to a RCC_ClockType structure which will hold
  *         the clocks frequencies.
  * @note   The result of this function could be not correct when using
  *         fractional value for HSE crystal.
  * @retval None
  */
void RCC_GetClocksFreq(RCC_ClockType* RCC_Clocks)
{
#if defined (AT32F415xx)
  uint32_t pllcfgen = 0, pllfref = 0, pllns = 0, pllms = 0, pllfr = 0;
  uint32_t retfref = 0, retfr = 0;
#endif
  uint32_t tmp = 0, pllmult = 0, pllrefclk = 0, psc = 0;

  /* Get SYSCLK source -------------------------------------------------------*/
  tmp = RCC->CFG & RCC_CFG_SYSCLKSTS;

  switch (tmp)
  {
  case 0x00:  /* HSI used as system clock */
    RCC_Clocks->SYSCLK_Freq = HSI_VALUE;
    break;

  case 0x04:  /* HSE used as system clock */
    RCC_Clocks->SYSCLK_Freq = HSE_VALUE;
    break;

  case 0x08:  /* PLL used as system clock */
#if defined (AT32F415xx)
    /* Get_ClocksFreq for PLLconfig2 */
    pllcfgen = BIT_READ(RCC->PLL, PLL_CFGEN_MASK);

    if(pllcfgen == PLL_CFGEN_ENABLE)
    {
      pllfref = BIT_READ(RCC->PLL, PLL_FREF_MASK);
      pllns = BIT_READ(RCC->PLL, PLL_NS_MASK);
      pllms = BIT_READ(RCC->PLL, PLL_MS_MASK);
      pllfr = BIT_READ(RCC->PLL, PLL_FR_MASK);

      RCC_FREF_VALUE(pllfref, retfref);
      RCC_FR_VALUE(pllfr, retfr);

      RCC_Clocks->SYSCLK_Freq = (retfref * (pllns >> PLL_NS_POS)) / \
      ((pllms >> PLL_MS_POS) * retfr) * 1000000;
    }else
#endif
    {
      /* Get PLL clock source and multiplication factor ----------------------*/
      pllmult = BIT_READ(RCC->CFG, RCC_CFG_PLLMULT);
      pllrefclk = RCC->CFG & RCC_CFG_PLLRC;
      pllmult = RCC_GET_PLLMULT(pllmult);

      if (pllrefclk == 0x00)
      {
        /* HSI oscillator clock divided by 2 selected as PLL clock entry */
        RCC_Clocks->SYSCLK_Freq = (HSI_VALUE >> 1) * pllmult;
      }
      else
      {
        /* HSE selected as PLL clock entry */
        if ((RCC->CFG & RCC_CFG_PLLHSEPSC) != (uint32_t)RESET)
        {
          /* HSE oscillator clock divided by 2 */
          RCC_Clocks->SYSCLK_Freq = (HSE_VALUE >> 1) * pllmult;
        }
        else
        {
          RCC_Clocks->SYSCLK_Freq = HSE_VALUE * pllmult;
        }
      }
    }
#if !defined (AT32F415xx)
    if (((RCC->CFG & RCC_CFG_PLLRANGE) == 0) && (RCC_Clocks->SYSCLK_Freq > RCC_PLL_RANGE))
    {
      /* Not setup PLLRANGE, fixed in 72 MHz */
      RCC_Clocks->SYSCLK_Freq = RCC_PLL_RANGE;
    }
#endif
    break;

  default:
    RCC_Clocks->SYSCLK_Freq = HSI_VALUE;
    break;
  }

