RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_rcc.c
#if defined (AT32F403xx)
/**
  * @brief  Selects the clock source to output on CLKOUT pin.
  * @param  RCC_CLKOUT: specifies the clock source to output.
  *   This parameter can be one of the following values:
  *     @arg RCC_CLKOUT_NOCLK:    No clock selected
  *     @arg RCC_CLKOUT_SYSCLK:   System clock selected
  *     @arg RCC_CLKOUT_HSI:      HSI oscillator clock selected
  *     @arg RCC_CLKOUT_HSE:      HSE oscillator clock selected
  *     @arg RCC_CLKOUT_PLL_Div2: PLL clock divided by 2 selected
  *     @arg RCC_CLKOUT_PLL_Div4: PLL clock divided by 4 selected
  *     @arg RCC_CLKOUT_USB:      USB clock selected
  *     @arg RCC_CLKOUT_ADC:      ADC clock selected
  * @retval None
  */
void RCC_CLKOUTConfig(uint32_t RCC_CLKOUT)
{
    uint32_t tmpreg = 0;

        /* Check the parameters */
        assert_param(IS_RCC_CLKOUT(RCC_CLKOUT));

    if((RCC_CLKOUT >> 28) == 0)
        {
            // Clear CLKOUT[3];
            RCC->MISC &= ~RCC_MISC_CLKOUT_3;

            tmpreg = RCC->CFG;
            /* Clear CLKOUT[2:0] bits */
            tmpreg &= ~RCC_CFG_CLKOUT;
            /* Set CLKOUT[2:0] bits according to RCC_CLKOUT value */
            tmpreg |= RCC_CLKOUT;
            /* Store the new value */
            RCC->CFG = tmpreg;
        }
        else if((RCC_CLKOUT >> 28) == 1)
        {
            // Set CLKOUT[3];
            RCC->MISC &= ~RCC_MISC_CLKOUT_3;
            RCC->MISC |= RCC_MISC_CLKOUT_3;

            tmpreg = RCC->CFG;
            /* Clear CLKOUT[2:0] bits */
            tmpreg &= ~RCC_CFG_CLKOUT;
            /* Set CLKOUT[2:0] bits according to RCC_CLKOUT value */
            tmpreg |= (RCC_CLKOUT & 0xFFFFFFF);
            /* Store the new value */
            RCC->CFG = tmpreg;
        }
}
#else
/**
  * @brief  Selects the clock source to output on CLKOUT pin.
  * @param  RCC_CLKOUT: specifies the clock source to output.
  *   This parameter can be one of the following values:
  *     @arg RCC_CLKOUT_NOCLK:    No clock selected
  *     @arg RCC_CLKOUT_SYSCLK:   System clock selected
  *     @arg RCC_CLKOUT_HSI:      HSI oscillator clock selected
  *     @arg RCC_CLKOUT_HSE:      HSE oscillator clock selected
  *     @arg RCC_CLKOUT_PLL_Div2: PLL clock divided by 2 selected
  *     @arg RCC_CLKOUT_PLL_Div4: PLL clock divided by 4 selected
  *     @arg RCC_CLKOUT_USB:      USB clock selected
  *     @arg RCC_CLKOUT_ADC:      ADC clock selected
  * @note Just only at32f413xx & at32f415xx
  *     @arg RCC_CLKOUT_LSI:      LSI clock selected
  *     @arg RCC_CLKOUT_LSE:      LSE clock selected
  * @param  RCC_CLKOUTPRE: specifies the clock output prescaler.
  *   This parameter can be one of the following values:
  *     @arg RCC_MCOPRE_1  : division by 1 applied to CLKOUT clock
  *     @arg RCC_MCOPRE_2  : division by 2 applied to CLKOUT clock
  *     @arg RCC_MCOPRE_4  : division by 4 applied to CLKOUT clock
  *     @arg RCC_MCOPRE_8  : division by 8 applied to CLKOUT clock
  *     @arg RCC_MCOPRE_16 : division by 16 applied to CLKOUT clock
  *     @arg RCC_MCOPRE_64 : division by 64 applied to CLKOUT clock
  *     @arg RCC_MCOPRE_128: division by 128 applied to CLKOUT clock
  *     @arg RCC_MCOPRE_256: division by 256 applied to CLKOUT clock
  *     @arg RCC_MCOPRE_512: division by 512 applied to CLKOUT clock
  * @retval None
  */
void RCC_CLKOUTConfig(uint32_t RCC_CLKOUT, uint32_t RCC_CLKOUTPRE)
{
    uint32_t tmpreg = 0;

        /* Check the parameters */
        assert_param(IS_RCC_CLKOUT(RCC_CLKOUT));
    assert_param(IS_RCC_MCO(RCC_CLKOUTPRE));

    /* Config MCOPRE */
    RCC->MISC &= ~RCC_MCOPRE_MASK;
    RCC->MISC |= RCC_CLKOUTPRE;

    if((RCC_CLKOUT >> 28) == 0)
        {
            // Clear CLKOUT[3];
            RCC->MISC &= ~RCC_MISC_CLKOUT_3;

            tmpreg = RCC->CFG;
            /* Clear CLKOUT[2:0] bits */
            tmpreg &= ~RCC_CFG_CLKOUT;
            /* Set CLKOUT[2:0] bits according to RCC_CLKOUT value */
            tmpreg |= RCC_CLKOUT;
            /* Store the new value */
            RCC->CFG = tmpreg;
        }
        else if((RCC_CLKOUT >> 28) == 1)
        {
            // Set CLKOUT[3];
            RCC->MISC &= ~RCC_MISC_CLKOUT_3;
            RCC->MISC |= RCC_MISC_CLKOUT_3;

            tmpreg = RCC->CFG;
            /* Clear CLKOUT[2:0] bits */
            tmpreg &= ~RCC_CFG_CLKOUT;
            /* Set CLKOUT[2:0] bits according to RCC_CLKOUT value */
            tmpreg |= (RCC_CLKOUT & 0xFFFFFFF);
            /* Store the new value */
            RCC->CFG = tmpreg;
        }
}
#endif
/**
  * @brief  Checks whether the specified RCC flag is set or not.
  * @param  RCC_Flag: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg RCC_FLAG_HSISTBL:  HSI oscillator clock ready
  *     @arg RCC_FLAG_HSESTBL:  HSE oscillator clock ready
  *     @arg RCC_FLAG_PLLSTBL:  PLL clock ready
  *     @arg RCC_FLAG_LSESTBL:  LSE oscillator clock ready
  *     @arg RCC_FLAG_LSISTBL:  LSI oscillator clock ready
  *     @arg RCC_FLAG_PINRST:   Pin reset
  *     @arg RCC_FLAG_PORST:    POR/PDR reset
  *     @arg RCC_FLAG_SWRST:    Software reset
  *     @arg RCC_FLAG_IWDGRST:  Independent Watchdog reset
  *     @arg RCC_FLAG_WWDGRST:  Window Watchdog reset
  *     @arg RCC_FLAG_LPRST:    Low Power reset
  *
  * @retval The new state of RCC_Flag (SET or RESET).
  */
FlagStatus RCC_GetFlagStatus(uint8_t RCC_Flag)
{
  uint32_t tmp = 0;
  uint32_t statusreg = 0;
  FlagStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_RCC_FLAG(RCC_Flag));

  /* Get the RCC register index */
  tmp = RCC_Flag >> 5;

  if (tmp == 1)               /* The flag to check is in CTRL register */
  {
    statusreg = RCC->CTRL;
  }
  else if (tmp == 2)          /* The flag to check is in BDC register */
  {
    statusreg = RCC->BDC;
  }
  else                       /* The flag to check is in CTRLSTS register */
  {
    statusreg = RCC->CTRLSTS;
  }

  /* Get the flag position */
  tmp = RCC_Flag & FLAG_Mask;

  if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  /* Return the flag status */
  return bitstatus;
}

/**
  * @brief  Clears the RCC reset flags.
  * @note   The reset flags are: RCC_FLAG_PINRST, RCC_FLAG_PORST, RCC_FLAG_SWRST,
  *   RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST, RCC_FLAG_LPRST
  * @param  None
  * @retval None
  */
void RCC_ClearFlag(void)
{
  /* Set RSTFC bit to clear the reset flags */
  RCC->CTRLSTS |= RCC_CTRLSTS_RSTFC;
}

/**
  * @brief  Checks whether the specified RCC interrupt has occurred or not.
  * @param  RCC_INT: specifies the RCC interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg RCC_INT_LSISTBL: LSI ready interrupt
  *     @arg RCC_INT_LSESTBL: LSE ready interrupt
  *     @arg RCC_INT_HSISTBL: HSI ready interrupt
  *     @arg RCC_INT_HSESTBL: HSE ready interrupt
  *     @arg RCC_INT_PLLSTBL: PLL ready interrupt
  *     @arg RCC_INT_HSECFD:  Clock Security System interrupt
  *
  * @retval The new state of RCC_INT (SET or RESET).
  */
ITStatus RCC_GetINTStatus(uint8_t RCC_INT)
{
  ITStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_RCC_INT_STS(RCC_INT));

  /* Check the status of the specified RCC interrupt */
  if ((RCC->CLKINT & RCC_INT) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

