RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_rcc.c
  /* Return the RCC_INT status */
  return  bitstatus;
}

/**
  * @brief  Clears the RCC's interrupt pending bits.
  * @param  RCC_INT: specifies the interrupt pending bit to clear.
  *   This parameter can be any combination of the
  *   following values:
  *     @arg RCC_INT_LSISTBL: LSI ready interrupt
  *     @arg RCC_INT_LSESTBL: LSE ready interrupt
  *     @arg RCC_INT_HSISTBL: HSI ready interrupt
  *     @arg RCC_INT_HSESTBL: HSE ready interrupt
  *     @arg RCC_INT_PLLSTBL: PLL ready interrupt
  *
  *     @arg RCC_INT_HSECFD: Clock Security System interrupt
  * @retval None
  */
void RCC_ClearINTPendingBit(uint8_t RCC_INT)
{
  /* Check the parameters */
  assert_param(IS_RCC_INT_CLR(RCC_INT));

  /* Perform Byte access to RCC_CLKINT[23:16] bits to clear the selected interrupt
     pending bits */
  *(__IO uint8_t *) CLKINT_BYTE3_CLR_ADDR = RCC_INT;
}

/**
  * @brief  Delay After HSE Enable,.
  * @param  delay: Number Of Nops.
  * @retval None
  */
static void RCC_HSEENDelay(uint32_t delay)
{
  uint32_t i;

  for(i = 0; i < delay; i++)
    ;
}

#if defined (AT32F413xx) || defined (AT32F415xx) || \
    defined (AT32F403Axx)|| defined (AT32F407xx)
/**
  * @brief  Enables or disables the Auto Step Mode.
  * @note   This function called when sysclk greater than 108Mhz.
  * @param  NewState: new state of the Step Mode. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_StepModeCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if(ENABLE == NewState)
    {
    RCC->MISC2 |= RCC_MISC2_AUTO_STEP_EN;
    }
    else
    {
    RCC->MISC2 &= ~RCC_MISC2_AUTO_STEP_EN;
    }
}

/**
  * @brief  Enables or disables to get USB clock source from HSI 48M directly.
  * @note   Attention: If enable, the hsi clock frequency also has fixed 48M.
  * @param  NewState: new state of the USB clock source. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_HSI2USB48M(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if(ENABLE == NewState)
    {
    RCC->MISC  |= RCC_MISC_HSI_DIV_EN;
    RCC->MISC2 |= RCC_MISC2_HSI_FOR_USB;
    }
    else
    {
    RCC->MISC  &= ~RCC_MISC_HSI_DIV_EN;
    RCC->MISC2 &= ~RCC_MISC2_HSI_FOR_USB;
    }
}
#endif

#if defined (AT32F403Axx)|| defined (AT32F407xx)
/**
  * @brief  HSE Divider configura.
  * @note   This function config HSE divider.
  * @param  HSEDiv: RCC_HSE_DIV_2. HSE divider 2 for pll.
  *                 RCC_HSE_DIV_3. HSE divider 3 for pll.
  *                 RCC_HSE_DIV_4. HSE divider 4 for pll.
  *                 RCC_HSE_DIV_5. HSE divider 5 for pll.
  * @retval None
  */
void RCC_HSEDivConfig(uint32_t HSEDiv)
{
  /* Check the parameters */
  assert_param(IS_RCC_HSEDIV(HSEDiv));

  RCC->MISC2 &= ~RCC_HSE_DIV_MASK;
  RCC->MISC2 |= HSEDiv;
}
#endif

#if defined (AT32F413xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
/**
  * @brief  Enables or disables the USB INT remap.
  * @note   Remap the default USB_HP_IRQn & USB_LP_IRQn (19,20) to other IRQns(73, 74).
  * @param  NewState: new state of the USB INT remap. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_USBINTRemap(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if(ENABLE == NewState)
    {
    RCC->INTCTRL |= RCC_INTCTRL_USB_INT_CTRL;
    }
    else
    {
    RCC->INTCTRL &= ~RCC_INTCTRL_USB_INT_CTRL;
    }
}

/**
  * @brief  Enables or disables MCO output to TMR10_CH0.
  * @note   This function can enable MCO inner connect to TMR10_CH0.
  * @param  NewState: new state of the MCO to TMR10_CH0. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_MCO2TMR10(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if(ENABLE == NewState)
    {
    RCC->TEST  |= RCC_TEST_MCO2TMR_EN;
    }
    else
    {
    RCC->TEST  &= ~RCC_TEST_MCO2TMR_EN;
    }
}
#endif

#if defined (AT32F415xx)
/**
  * @brief  Config pll with RCC_PLL.
  * @note   This function can usd RCC_PLL register to config pll, not RCC_CFG_MULT.
  *                        PLL_freq_n_Mhz * PLL_ns
  *         PLL clock = -------------------------------
  *                           PLL_ms * PLL_fr_n
  *         ATTEMTION:
  *                  31 <= PLL_ns <= 500
  *                  1  <= PLL_ms <= 15
  *
  *                       PLL_freq_n_Mhz * PLL_ns
  *         500Mhz <=  ------------------------------ <= 1000Mhz
  *                               PLL_ms
  * @param  PLL_fref: The freqence of PLL source clock.
  *     @arg PLL_FREF_4M :  reference clock 4Mhz
  *     @arg PLL_FREF_6M :  reference clock 6Mhz
  *     @arg PLL_FREF_8M :  reference clock 8Mhz
  *     @arg PLL_FREF_12M:  reference clock 12Mhz
  *     @arg PLL_FREF_16M:  reference clock 16Mhz
  *     @arg PLL_FREF_25M:  reference clock 25Mhz
  * @param  PLL_ns: PLL register ns value.
  * @param  PLL_ms: PLL register ms value.
  * @param  PLL_fr: VCO output divider
  *     @arg PLL_FR_1 :  output divider 1
  *     @arg PLL_FR_2 :  output divider 2
  *     @arg PLL_FR_4 :  output divider 4
  *     @arg PLL_FR_8 :  output divider 8
  *     @arg PLL_FR_16:  output divider 16
  *     @arg PLL_FR_32:  output divider 32
  * @retval None
  */
void RCC_PLLconfig2(uint32_t PLL_fref, uint32_t PLL_ns, uint32_t PLL_ms, uint32_t PLL_fr)
{
    volatile uint32_t result = 0;
  uint32_t pll_reg = 0, ret = 0;

  assert_param(IS_RCC_FR(PLL_fr));
  assert_param(IS_RCC_FREF(PLL_fref));
  assert_param(IS_RCC_NS_VALUE(PLL_ns));
  assert_param(IS_RCC_MS_VALUE(PLL_ms));

  RCC_FREF_VALUE(PLL_fref, ret);

  result = PLL_ns * ret / PLL_ms;

  assert_param(IS_RCC_RESULT_VALUE(result));

  pll_reg = RCC->PLL;

  /* Clear PLL */
  pll_reg &= ~(PLL_FR_MASK | PLL_MS_MASK | PLL_NS_MASK | PLL_FREF_MASK | PLL_CFGEN_MASK);

  /* Config pll */
  pll_reg |= (PLL_fref | (PLL_ns << PLL_NS_POS) | (PLL_ms << PLL_MS_POS) | PLL_fr);

  /* Enable PLLGEN */
  pll_reg |= PLL_CFGEN_ENABLE;

  RCC->PLL = pll_reg;
}
#endif

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


